
// Типы данных:
/**
 * 1. Примитивные 
 * - Number: 2019, 1.5, NaN (ошибка в вычислениях), Infinity (При делении на ноль)
 * - String: 'Hello', "Hello", `Hello`. 
 * - Boolean: true, false
 * - Null: null. Данный тип указывает, что значение неизвестно
 * - Undefined: undefined. Указывает, что переменная ничему не равна
 * - Symbol()
 */

/**
 * 2. Объекты. Это ссылочный тип данных (Передаются по ссылке). 
 * Объект состоит из пары ключ-значение. С помощью объекта можно описать любую сущность.
 * Набор свойств и методов. Свойства - ключ, содержащий значение; Методы - ключи, которые содержат в себе функции.
 * Так же подтипами объектов являются массивы, функции и все сложные данные.
 * Примеры:
 * - Object: {name: 'denis', age: 30}
 * * Array: [1, 2, 3]
 * * Function: function foo() {}
 * * Date: new Date()
 * ....
 */ 

/**
 * 1. JS динамическая типизированный язык
 * 2. Одно и то же переменная может хранить в себе любой тип данных
 * 3. Нам не нужно определять тип данных при создании переменных
 * 4. Если мы хотим использовать статическую типизацию, используем TypeScript или flow
 */
